app/controllers/todo_item_controller.rb

  def index
    @todo_item = TodoItem.all
---
SELECT "todo_items".* FROM "todo_items"